In [2]:
import pandas as pd

In [4]:
pd.DataFrame([[300, 15, "yes"], [400, 30, "no"], [500, 40, "yes"]]) #Lista simple

     0   1    2
0  300  15  yes
1  400  30   no
2  500  40  yes

In [6]:
df = pd.DataFrame([[300, 15, "yes"], [400, 30, "no"], [500, 40, "yes"]], columns = ['Sales', 'Units', 'Promotions'])

In [7]:
df

   Sales  Units Promotions
0    300     15        yes
1    400     30         no
2    500     40        yes

Using dictionarios

In [8]:
d = {"jan": [200, 300], "feb": [300, 400]}

In [9]:
d

{'jan': [200, 300], 'feb': [300, 400]}

In [10]:
pd.DataFrame(d, index = ['Sales', 'Customers'])

           jan  feb
Sales      200  300
Customers  300  400

Numpy

In [11]:
import numpy as np

In [14]:
data = np.random.randint(0,10,(3,3))

In [15]:
data

array([[8, 9, 5],
       [3, 2, 2],
       [8, 3, 0]])

In [16]:
pd.DataFrame(data)

   0  1  2
0  8  9  5
1  3  2  2
2  8  3  0